{
  "navigation": {
    "home": "Inicio",
    "experience": "Experiencia",
    "projects": "Proyectos",
    "skills": "Habilidades",
    "contact": "Contacto"
  },
  "home": {
    "title": "Agustin Policano",
    "subtitle": "Desarrollador Frontend",
    "viewProjects": "Ver Proyectos"
  },
  "projects": {
    "title": "Proyectos",
    "description": "Una selección de mi trabajo más reciente, construido con tecnologías modernas y diseño limpio.",
    "viewDetails": "MÁS DETALLES",
    "items": {
      "archivio": {
        "name": "Archivio (En proceso)",
        "type": "IA & WhatsApp Bot",
        "description": "Bot de IA que utiliza RAG (Retrieval Augmented Generation) para procesar documentos subidos por el usuario y responder consultas vía WhatsApp. Frontend desarrollado con Vite, backend en Node.js y base de datos PostgreSQL en Railway."
      },
      "alchimie": {
        "name": "Alchimie",
        "type": "Landing Page",
        "description": "Landing page moderna para una marca de perfumería, desarrollada como aplicación fullstack con Next.js (frontend y backend integrados) y base de datos en Railway. Diseño elegante y experiencia de usuario optimizada."
      },
      "beersech": {
        "name": "Beersech",
        "type": "Sitio Web Corporativo",
        "description": "Sitio web corporativo para agencia digital desarrollado con Next.js, enfocado en servicios de marketing y desarrollo web con diseño moderno y responsive."
      },
      "rankmycv": {
        "name": "RankMyCv",
        "type": "IA & Análisis de CV",
        "description": "Herramienta de inteligencia artificial que analiza tu CV y lo compara con descripciones de trabajo o enlaces de LinkedIn. Realiza scraping de ofertas de LinkedIn y proporciona análisis detallado de compatibilidad y recomendaciones de mejora."
      },
      "ecochoice": {
        "name": "EcoChoice",
        "type": "Optimización WordPress",
        "description": "Optimización completa de sitio WordPress para empresa de paisajismo y diseño de espacios verdes. Mejoras significativas en SEO y velocidad de carga según métricas de Lighthouse."
      },
      "dakari": {
        "name": "Dakari",
        "type": "Migración Tecnológica",
        "description": "Migración completa de sitio web desde WordPress a Next.js, logrando mejoras sustanciales en rendimiento, velocidad de carga y experiencia de usuario general."
      },
      "descriptio": {
        "name": "Descriptio",
        "type": "Herramienta IA",
        "description": "Generador inteligente de descripciones utilizando inteligencia artificial, optimizado para múltiples casos de uso."
      },
      "ffdiamond": {
        "name": "FFDiamond",
        "type": "Plataforma E-commerce",
        "description": "Plataforma para compra de diamantes de FreeFire desarrollada con Vite. Implementación de sistema de pagos con MercadoPago y Stripe, verificación de transferencias bancarias y panel de administración completo."
      }
    }
  },
  "experience": {
    "title": "Experiencia",
    "jobs": {
      "current": {
        "company": "Almundo",
        "role": "Software Engineer SSR",
        "duration": "Sept 2025 - Actualidad",
        "location": "Buenos Aires, Argentina",
        "responsibilities": [
          "Desarrollo frontend en Angular.",
          "Trabajo con Node.js implementando arquitectura BFF (Backend for Frontend) para optimizar la comunicación entre frontend y backend.",
          "Uso de Docker para containerización y despliegue de aplicaciones.",
          "Desarrollo y mantenimiento de librerías internas basadas en Angular, contribuyendo a la arquitectura y reutilización de componentes."
        ]
      },
      "techcorp": {
        "company": "Omint",
        "role": "Frontend Developer SSR",
        "duration": "Mar 2023 - Sept 2025",
        "location": "Buenos Aires, Argentina",
        "responsibilities": [
          "Desarrollo y mantenimiento del proyecto Médico Online, plataforma de telemedicina iniciada antes de la pandemia.",
          "Migración de código de JavaScript y jQuery a React (18.3.1) con Redux y Tokbox.",
          "Participación en el desarrollo con .NET y C# para la lógica de backend.",
          "Uso de Angular v13 y manejo de bases de datos con SQL (2022)."
        ]
      },
      "innosoft": {
        "company": "Qubik Digital",
        "role": "Angular Developer Spartacus (SAP)",
        "duration": "May 2022 - Oct 2022",
        "location": "Buenos Aires, Argentina",
        "responsibilities": [
          "Desarrollo en Spartacus, un framework basado en Angular para SAP Commerce.",
          "Implementación de nuevas funcionalidades y optimización de componentes en Spartacus para mejorar la experiencia del usuario.",
          "Participación en los proyectos Deprati (Vue.js) y Promesa (Spartacus), colaborando en el diseño e implementación de interfaces interactivas y dinámicas.",
          "Aplicación de metodología SCRUM con Jira y uso de Bitbucket para la gestión de código y versionado."
        ]
      },
      "accusys": {
        "company": "Accusys Technology",
        "role": "Angular Developer SSR",
        "duration": "Oct 2021 - Abr 2022",
        "location": "Buenos Aires, Argentina",
        "responsibilities": [
          "Desarrollo e integración de módulos en Angular v11 para una plataforma de pagos bancarios.",
          "Trabajo en Software Factory con rotación entre proyectos.",
          "Implementación de metodología SCRUM para mejor seguimiento del trabajo diario.",
          "Gestión de repositorios mediante TFS 2018 y Git para manejo de ramas."
        ]
      },
      "seenka": {
        "company": "Seenka",
        "role": "Angular Developer",
        "duration": "Feb 2022 - Abr 2022",
        "location": "Freelance a tiempo definido",
        "responsibilities": [
          "Trabajo freelance utilizando metodología SCRUM con gestión de tickets.",
          "Desarrollo en proyecto de marketing para empresas con arquitectura de Micro-Servicios y GraphQL.",
          "Trabajo con Angular (V9) en conjunto con el encargado del frontend.",
          "Gestión de repositorios mediante GitLab y documentación con Notion."
        ]
      },
      "banhaia": {
        "company": "Banhaia",
        "role": "Angular Developer Trainee",
        "duration": "May 2021 - Sept 2021",
        "location": "Buenos Aires, Argentina",
        "responsibilities": [
          "Primera experiencia profesional con capacitación en Angular (V8).",
          "Aprendizaje de fundamentos de programación, Git y metodologías SCRUM.",
          "Desarrollo de trabajo en equipo y habilidades de colaboración.",
          "Contribución en la creación de interfaces mediante Figma."
        ]
      }
    }
  },
  "skills": {
    "title": "Habilidades",
    "description": "Herramientas y tecnologías que uso para desarrollar productos modernos y escalables.",
    "typescript": {
      "title": "TypeScript & JavaScript",
      "description": "Trabajo con ambos lenguajes según el proyecto, priorizando buenas prácticas y tipado estático con TypeScript."
    },
    "uiux": {
      "title": "UI/UX & Diseño",
      "description": "Diseño interfaces funcionales y modernas en Figma y las implemento con Tailwind, Shadcn o Angular Material."
    },
    "devops": {
      "title": "DevOps & Deploy",
      "description": "Uso Vercel, VPS con Nginx y Docker para deploy. Tengo experiencia en configuración y mantenimiento de entornos productivos."
    },
    "tools": {
      "title": "Herramientas & Flujo de trabajo",
      "description": "Git, GitHub, extensiones de VSCode, terminal y otras herramientas clave para un desarrollo ágil y profesional."
    },
    "architecture": {
      "title": "Lógica & Arquitectura",
      "description": "Diseño de estructuras de código escalables, patrones de diseño y arquitecturas de software que faciliten el mantenimiento y crecimiento de aplicaciones."
    },
    "automation": {
      "title": "APIs & Automatizaciones",
      "description": "Integración de APIs REST, automatización de procesos y desarrollo de scripts para optimizar flujos de trabajo y conectar sistemas."
    },
    "react": {
      "title": "React",
      "description": "Desarrollo de interfaces interactivas y componentes reutilizables con React, utilizando hooks, context API y mejores prácticas de desarrollo."
    },
    "nextjs": {
      "title": "Next.js",
      "description": "Desarrollo de aplicaciones fullstack con Next.js, aprovechando SSR, SSG y API routes para crear experiencias web optimizadas."
    },
    "angular": {
      "title": "Angular",
      "description": "Experiencia en desarrollo con Angular, incluyendo componentes, servicios, routing y gestión de estado con RxJS."
    },
    "nodejs": {
      "title": "Node.js",
      "description": "Desarrollo de servidores y APIs backend con Node.js, Express y otras tecnologías del ecosistema JavaScript."
    },
    "python": {
      "title": "Python",
      "description": "Desarrollo de scripts, automatizaciones y herramientas con Python, incluyendo procesamiento de datos y APIs."
    },
    "database": {
      "title": "Bases de Datos",
      "description": "Trabajo con PostgreSQL, MongoDB y otras bases de datos relacionales y NoSQL para almacenar y gestionar datos eficientemente."
    },
    "docker": {
      "title": "Docker",
      "description": "Containerización de aplicaciones con Docker, creación de imágenes y orquestación de contenedores para despliegues consistentes."
    },
    "git": {
      "title": "Git & Control de Versiones",
      "description": "Gestión de código con Git, GitHub, GitLab y Bitbucket. Experiencia en workflows colaborativos, branching strategies y CI/CD."
    }
  },
  "contact": {
    "title": "Ponete en Contacto",
    "description": "Siempre estoy interesado en nuevas oportunidades, colaboraciones o simplemente una charla.",
    "location": "Buenos Aires — Disponible para freelance",
    "email": "Email",
    "github": "GitHub",
    "linkedin": "LinkedIn",
    "twitter": "Twitter",
    "downloadCV": "Descargar CV",
    "inspirational": "Construyamos algo grandioso juntos."
  },
  "language": {
    "es": "Español",
    "en": "English"
  },
  "languageSelector": "Idioma"
} 